"下一步" = "XNext";
"当前没有可编辑的资源" = "XThere are no editable resources available";
"当前没有可删除的资源" = "XThere is currently no resource to delete";
"确定删除这张照片吗?" = "XAre you sure to delete this photo?";
"确定删除这个视频吗?" = "XAre you sure to delete this video?";
"删除" = "XDelete";
"编辑" = "XEdit";
"原始值" = "XOriginal";
"正方形" = "XA square";
"还原" = "XReset";
"旋转" = "XRotating";
"选择" = "XChoose";
"选择照片时不能选择视频" = "XYou can't select video when you select a photo";
"没有照片可选!" = "XNo photos available!";
"正在下载iCloud上的资源" = "XDownloading resources on iCloud";
"昨天" = "XYesterday";
"下载失败，请重试！" = "XDownload failed, please try again!";
"张照片" = "XPhotos";
"个视频" = "XVideo";
"返回"= "XBack";
"取消" = "XCancel";
"预览" = "XPreview";
"原图" = "XOriginal";
"设置" = "XSetting";
"确定" = "XDone";
"Photos" = "XPhotos";
"Photo" = "XPhoto";
"Videos" = "XVideos";
"Video" = "XVideo";
"提示" = "XPrompt";
"是否删除此照片" = "XDelete this photo";
"完成" = "XDone";
"关闭" = "XClose";
"拍摄" = "XCamera";
"拍摄失败" = "XShoot failure";
"裁剪" = "XTailor";
"抱歉" = "XSorry";
"重拍" = "XAgain";
"相机" = "XCamera";
"照片" = "XPhoto";
"视频" = "XVideo";
"相册" = "XAlbums";
"加载中" = "XLoading";
"处理中" = "XProcessing...";
"拍照" = "XTake a picture";
"摄像" = "XCamera shooting";
"点击拍照" = "XClick on the photo";
"长按录像" = "XLong press the video";
"点击录制" = "XClick on the recording";
"点击拍照，长按录像" = "XClick on the photo and the video is long";
"处理失败,请重试!" = "XFail to handle, please try again!";
"无法使用相机!" = "XCan not use camera!";
"照片正在下载" = "XPhotos are being downloaded";
"已达最大数!" = "XArrive maximum!";
"照片已达最大数!" = "XPhotos maximum!";
"视频已达最大数!" = "XVideos maximum!";
"最多只能选择%ld张图片" = "X%ld photos maximum";
"最多只能选择%ld个视频" = "X%ld videos maximum";
"最多只能选择%ld个" = "X%ld choose maximum";
"图片不能和视频同时选择" = "XCan not choose both video and photo";
"视频不能和图片同时选择" = "XCan not choose both photo and video";
"视频少于%ld秒，无法选择" = "XVideo is shorther than %ld s\ncan't be used currently";
"视频大于%ld秒，无法选择" = "XVideo is greater than %ld s\nand cannot be selected";
"录制时间少于%.0f秒" = "XRecord time cannot be\nless than %.0f seconds";
"请在设置-隐私-相机中允许访问相机" = "XPlease allow to access your camera in \"Settings -> Privacy -> Camera\"";
"无法访问照片\n请点击这里前往设置中允许访问照片" = "XUnable to access photos\nPlease click here\nto go to Settings to allow access to photos";
"无法使用相机" = "XCan not use camera";
"无法访问照片，请前往设置中允许\n访问照片" = "XUnable to access photos\ngo to Settings to\nallow access to photos";
"无法使用麦克风" = "XCan not use microphone";
"请在设置-隐私-相机中允许访问麦克风" = "XPlease allow to access your camera in \"Settings -> Privacy -> microphone\"";
"无法访问所有照片\n请点击这里前往设置中允许访问所有照片" = "XUnable to access all photos\nPlease click here to go to settings to allow access to all photos.";
"无法访问所有照片" = "XUnable to access all photos";
"请在设置-隐私-相册中允许访问所有照片" = "XPlease allow access to all photos in settings privacy album";
"照片保存失败!" = "XPhotos saves failed!";
"视频保存失败!" = "XVideo saves failed!";
"保存失败，无法访问照片\n请前往设置中允许访问照片" = "XUnable to access photos\ngo to Settings to\nallow access to photos";
"没有可选的照片!" = "XNo photo optional!";
"视频已被删除!" = "XVideo has been deleted!";
"尚未从iCloud上下载，请至系统相册下载完毕后选择" = "XYou have not yet downloaded from iCloud, please go to the album after downloading";
"麦克风添加失败，录制视频会没有声音哦!" = "XThe microphone will fail\nand video will be recorded without sound!";
"%.0f秒内的视频无效哦~" = "XThe video in %.0f seconds is not valid";
"录制视频失败!" = "XRecord video failed!";
"继续录制" = "XContinue to record";
"无法访问相册" = "XUnable to access album";
"请在设置-隐私-相册中允许访问相册" = "XPlease allow to access your album in \"Settings -> Privacy -> Album\"";
"相机胶卷" = "XCamera Roll";
"所有照片" = "XAll Photos";
"今天" = "Today";
"编辑后，GIF将会变为静态图，确定继续吗？" = "XAfter editing, the GIF will become a static image. Are you sure you want to continue?";
"编辑后，LivePhoto将会变为静态图，确定继续吗？" = "XAfter editing, LivePhoto will become a static image. Are you sure you want to continue?";
"获取视频失败!" = "XFailed to get video!";
"确定取消吗?" = "XAre you sure to cancel?";
"继续" = "XContinue";
"获取" = "XGain";
"处理失败，请重试" = "XHandle failure, please try again";
"选择照片时不能选择视频" = "XYou can't select video when you select a photo";
"选择视频时不能选择照片" = "XYou can't select photos when you select video";
"只能选择%ld秒内的视频，需进行编辑" = "XOnly select video within %ld seconds for editing";
"从手机相册选择" = "XChoose from Album";
"正在下载网络图片，请稍等" = "XPlease wait while downloading web pictures";
"正在获取照片大小，请稍等" = "XGetting photo size, please wait";
"照片大小超过最大限制%@" = "XPhoto size exceeds maximum limit %@";
"视频大小超过最大限制%@" = "XVideo size exceeds maximum limit %@";
"照片或视频" = "XTake a photo or video";
"轻触拍照" = "XTouch to take a picture";
"按住摄像" = "XPress and hold camera";
"轻触拍照，按住摄像" = "XTap to take photo and hold to record video";
"要删除这张照片吗?" = "XDo you want to delete this photo?";
"要删除此视频吗?" = "XDo you want to delete this video?";
"自由" = "Xfree";
"松手即可删除" = "XLet go to delete";
"拖动到此处删除" = "XDrag here to delete";
"仅可访问部分照片，建议开启「所有照片」" = "XOnly some photos can be accessed, it is recommended to open all photos";
"去设置" = "XGo to set";
"更多" = "XMore";

"HXAlbumCameraRoll" = "XCamera Roll";
"HXAlbumPanoramas" = "XPanoramas";
"HXAlbumVideos" = "XVideos";
"HXAlbumFavorites" = "XFavorites";
"HXAlbumTimelapses" = "XTime-Lapse";
"HXAlbumRecents" = "XRecents";
"HXAlbumRecentlyAdded" = "XRecently Added";
"HXAlbumBursts" = "XBursts";
"HXAlbumSlomoVideos" = "XSlo-mo";
"HXAlbumSelfPortraits" = "XSelfies";
"HXAlbumScreenshots" = "XScreenshots";
"HXAlbumDepthEffect" = "XDepth Effect";
"HXAlbumLivePhotos" = "XLive Photo";
"HXAlbumAnimated" = "XAnimated";
